grevaillot/svd_tools/headers/STM32G474xx/dmamux.h
#pragma once 

/* --- DMAMUX: DMAMUX ----------------------------------------------- */

/** @defgroup dmamux_registers DMAMUX Register
@{*/

/** DMAMUX_C0CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C0CR			MMIO32(DMAMUX_BASE + 0x00)
/** DMAMUX_C1CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C1CR			MMIO32(DMAMUX_BASE + 0x04)
/** DMAMUX_C2CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C2CR			MMIO32(DMAMUX_BASE + 0x08)
/** DMAMUX_C3CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C3CR			MMIO32(DMAMUX_BASE + 0x0c)
/** DMAMUX_C4CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C4CR			MMIO32(DMAMUX_BASE + 0x10)
/** DMAMUX_C5CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C5CR			MMIO32(DMAMUX_BASE + 0x14)
/** DMAMUX_C6CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C6CR			MMIO32(DMAMUX_BASE + 0x18)
/** DMAMUX_C7CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C7CR			MMIO32(DMAMUX_BASE + 0x1c)
/** DMAMUX_C8CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C8CR			MMIO32(DMAMUX_BASE + 0x20)
/** DMAMUX_C9CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C9CR			MMIO32(DMAMUX_BASE + 0x24)
/** DMAMUX_C10CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C10CR			MMIO32(DMAMUX_BASE + 0x28)
/** DMAMUX_C11CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C11CR			MMIO32(DMAMUX_BASE + 0x2c)
/** DMAMUX_C12CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C12CR			MMIO32(DMAMUX_BASE + 0x30)
/** DMAMUX_C13CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C13CR			MMIO32(DMAMUX_BASE + 0x34)
/** DMAMUX_C14CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C14CR			MMIO32(DMAMUX_BASE + 0x38)
/** DMAMUX_C15CR DMAMux - DMA request line multiplexer channel x control register **/
#define DMAMUX_C15CR			MMIO32(DMAMUX_BASE + 0x3c)
/** DMAMUX_CSR DMAMUX request line multiplexer interrupt channel status register **/
#define DMAMUX_CSR			MMIO32(DMAMUX_BASE + 0x80)
/** DMAMUX_CFR DMAMUX request line multiplexer interrupt clear flag register **/
#define DMAMUX_CFR			MMIO32(DMAMUX_BASE + 0x84)
/** DMAMUX_RG0CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX_RG0CR			MMIO32(DMAMUX_BASE + 0x100)
/** DMAMUX_RG1CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX_RG1CR			MMIO32(DMAMUX_BASE + 0x104)
/** DMAMUX_RG2CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX_RG2CR			MMIO32(DMAMUX_BASE + 0x108)
/** DMAMUX_RG3CR DMAMux - DMA request generator channel x control register **/
#define DMAMUX_RG3CR			MMIO32(DMAMUX_BASE + 0x10c)
/** DMAMUX_RGSR DMAMux - DMA request generator status register **/
#define DMAMUX_RGSR			MMIO32(DMAMUX_BASE + 0x140)
/** DMAMUX_RGCFR DMAMux - DMA request generator clear flag register **/
#define DMAMUX_RGCFR			MMIO32(DMAMUX_BASE + 0x144)

/**@}*/


/** @defgroup dmamux_c0cr C0CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C0CR_SYNC_ID_SHIFT		24
#define DMAMUX_C0CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c0cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C0CR_NBREQ_SHIFT		19
#define DMAMUX_C0CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c0cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C0CR_SPOL_SHIFT		17
#define DMAMUX_C0CR_SPOL_MASK		0x03
/** @defgroup dmamux_c0cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C0CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C0CR_SE		(1 << 16)
/** DMAMUX_C0CR_EGE Event generation enable/disable **/
#define DMAMUX_C0CR_EGE		(1 << 9)
/** DMAMUX_C0CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C0CR_SOIE		(1 << 8)

#define DMAMUX_C0CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C0CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c0cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c1cr C1CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C1CR_SYNC_ID_SHIFT		24
#define DMAMUX_C1CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c1cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C1CR_NBREQ_SHIFT		19
#define DMAMUX_C1CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c1cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C1CR_SPOL_SHIFT		17
#define DMAMUX_C1CR_SPOL_MASK		0x03
/** @defgroup dmamux_c1cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C1CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C1CR_SE		(1 << 16)
/** DMAMUX_C1CR_EGE Event generation enable/disable **/
#define DMAMUX_C1CR_EGE		(1 << 9)
/** DMAMUX_C1CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C1CR_SOIE		(1 << 8)

#define DMAMUX_C1CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C1CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c1cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c2cr C2CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C2CR_SYNC_ID_SHIFT		24
#define DMAMUX_C2CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c2cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C2CR_NBREQ_SHIFT		19
#define DMAMUX_C2CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c2cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C2CR_SPOL_SHIFT		17
#define DMAMUX_C2CR_SPOL_MASK		0x03
/** @defgroup dmamux_c2cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C2CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C2CR_SE		(1 << 16)
/** DMAMUX_C2CR_EGE Event generation enable/disable **/
#define DMAMUX_C2CR_EGE		(1 << 9)
/** DMAMUX_C2CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C2CR_SOIE		(1 << 8)

#define DMAMUX_C2CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C2CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c2cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c3cr C3CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C3CR_SYNC_ID_SHIFT		24
#define DMAMUX_C3CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c3cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C3CR_NBREQ_SHIFT		19
#define DMAMUX_C3CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c3cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C3CR_SPOL_SHIFT		17
#define DMAMUX_C3CR_SPOL_MASK		0x03
/** @defgroup dmamux_c3cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C3CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C3CR_SE		(1 << 16)
/** DMAMUX_C3CR_EGE Event generation enable/disable **/
#define DMAMUX_C3CR_EGE		(1 << 9)
/** DMAMUX_C3CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C3CR_SOIE		(1 << 8)

#define DMAMUX_C3CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C3CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c3cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

