grevaillot/svd_tools/headers/STM32G474xx/dmamux.h
/** @defgroup dmamux_c4cr C4CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C4CR_SYNC_ID_SHIFT		24
#define DMAMUX_C4CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c4cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C4CR_NBREQ_SHIFT		19
#define DMAMUX_C4CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c4cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C4CR_SPOL_SHIFT		17
#define DMAMUX_C4CR_SPOL_MASK		0x03
/** @defgroup dmamux_c4cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C4CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C4CR_SE		(1 << 16)
/** DMAMUX_C4CR_EGE Event generation enable/disable **/
#define DMAMUX_C4CR_EGE		(1 << 9)
/** DMAMUX_C4CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C4CR_SOIE		(1 << 8)

#define DMAMUX_C4CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C4CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c4cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c5cr C5CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C5CR_SYNC_ID_SHIFT		24
#define DMAMUX_C5CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c5cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C5CR_NBREQ_SHIFT		19
#define DMAMUX_C5CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c5cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C5CR_SPOL_SHIFT		17
#define DMAMUX_C5CR_SPOL_MASK		0x03
/** @defgroup dmamux_c5cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C5CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C5CR_SE		(1 << 16)
/** DMAMUX_C5CR_EGE Event generation enable/disable **/
#define DMAMUX_C5CR_EGE		(1 << 9)
/** DMAMUX_C5CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C5CR_SOIE		(1 << 8)

#define DMAMUX_C5CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C5CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c5cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c6cr C6CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C6CR_SYNC_ID_SHIFT		24
#define DMAMUX_C6CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c6cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C6CR_NBREQ_SHIFT		19
#define DMAMUX_C6CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c6cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C6CR_SPOL_SHIFT		17
#define DMAMUX_C6CR_SPOL_MASK		0x03
/** @defgroup dmamux_c6cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C6CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C6CR_SE		(1 << 16)
/** DMAMUX_C6CR_EGE Event generation enable/disable **/
#define DMAMUX_C6CR_EGE		(1 << 9)
/** DMAMUX_C6CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C6CR_SOIE		(1 << 8)

#define DMAMUX_C6CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C6CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c6cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c7cr C7CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C7CR_SYNC_ID_SHIFT		24
#define DMAMUX_C7CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c7cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C7CR_NBREQ_SHIFT		19
#define DMAMUX_C7CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c7cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C7CR_SPOL_SHIFT		17
#define DMAMUX_C7CR_SPOL_MASK		0x03
/** @defgroup dmamux_c7cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C7CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C7CR_SE		(1 << 16)
/** DMAMUX_C7CR_EGE Event generation enable/disable **/
#define DMAMUX_C7CR_EGE		(1 << 9)
/** DMAMUX_C7CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C7CR_SOIE		(1 << 8)

#define DMAMUX_C7CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C7CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c7cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c8cr C8CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C8CR_SYNC_ID_SHIFT		24
#define DMAMUX_C8CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c8cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C8CR_NBREQ_SHIFT		19
#define DMAMUX_C8CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c8cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C8CR_SPOL_SHIFT		17
#define DMAMUX_C8CR_SPOL_MASK		0x03
/** @defgroup dmamux_c8cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C8CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C8CR_SE		(1 << 16)
/** DMAMUX_C8CR_EGE Event generation enable/disable **/
#define DMAMUX_C8CR_EGE		(1 << 9)
/** DMAMUX_C8CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C8CR_SOIE		(1 << 8)

#define DMAMUX_C8CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C8CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c8cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c9cr C9CR DMAMux - DMA request line multiplexer channel x control register
@{*/


