grevaillot/svd_tools/headers/STM32G474xx/dmamux.h
#define DMAMUX_C9CR_SYNC_ID_SHIFT		24
#define DMAMUX_C9CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c9cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C9CR_NBREQ_SHIFT		19
#define DMAMUX_C9CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c9cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C9CR_SPOL_SHIFT		17
#define DMAMUX_C9CR_SPOL_MASK		0x03
/** @defgroup dmamux_c9cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C9CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C9CR_SE		(1 << 16)
/** DMAMUX_C9CR_EGE Event generation enable/disable **/
#define DMAMUX_C9CR_EGE		(1 << 9)
/** DMAMUX_C9CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C9CR_SOIE		(1 << 8)

#define DMAMUX_C9CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C9CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c9cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c10cr C10CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C10CR_SYNC_ID_SHIFT		24
#define DMAMUX_C10CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c10cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C10CR_NBREQ_SHIFT		19
#define DMAMUX_C10CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c10cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C10CR_SPOL_SHIFT		17
#define DMAMUX_C10CR_SPOL_MASK		0x03
/** @defgroup dmamux_c10cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C10CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C10CR_SE		(1 << 16)
/** DMAMUX_C10CR_EGE Event generation enable/disable **/
#define DMAMUX_C10CR_EGE		(1 << 9)
/** DMAMUX_C10CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C10CR_SOIE		(1 << 8)

#define DMAMUX_C10CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C10CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c10cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c11cr C11CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C11CR_SYNC_ID_SHIFT		24
#define DMAMUX_C11CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c11cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C11CR_NBREQ_SHIFT		19
#define DMAMUX_C11CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c11cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C11CR_SPOL_SHIFT		17
#define DMAMUX_C11CR_SPOL_MASK		0x03
/** @defgroup dmamux_c11cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C11CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C11CR_SE		(1 << 16)
/** DMAMUX_C11CR_EGE Event generation enable/disable **/
#define DMAMUX_C11CR_EGE		(1 << 9)
/** DMAMUX_C11CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C11CR_SOIE		(1 << 8)

#define DMAMUX_C11CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C11CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c11cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c12cr C12CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C12CR_SYNC_ID_SHIFT		24
#define DMAMUX_C12CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c12cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C12CR_NBREQ_SHIFT		19
#define DMAMUX_C12CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c12cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


#define DMAMUX_C12CR_SPOL_SHIFT		17
#define DMAMUX_C12CR_SPOL_MASK		0x03
/** @defgroup dmamux_c12cr_spol SPOL Synchronization event type selector Defines the synchronization event on the selected synchronization input:
@{*/
/**@}*/

/** DMAMUX_C12CR_SE Synchronous operating mode enable/disable **/
#define DMAMUX_C12CR_SE		(1 << 16)
/** DMAMUX_C12CR_EGE Event generation enable/disable **/
#define DMAMUX_C12CR_EGE		(1 << 9)
/** DMAMUX_C12CR_SOIE Interrupt enable at synchronization event overrun **/
#define DMAMUX_C12CR_SOIE		(1 << 8)

#define DMAMUX_C12CR_DMAREQ_ID_SHIFT		0
#define DMAMUX_C12CR_DMAREQ_ID_MASK		0x7f
/** @defgroup dmamux_c12cr_dmareq_id DMAREQID Input DMA request line selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_c13cr C13CR DMAMux - DMA request line multiplexer channel x control register
@{*/


#define DMAMUX_C13CR_SYNC_ID_SHIFT		24
#define DMAMUX_C13CR_SYNC_ID_MASK		0x1f
/** @defgroup dmamux_c13cr_sync_id SYNCID Synchronization input selected
@{*/
/**@}*/


#define DMAMUX_C13CR_NBREQ_SHIFT		19
#define DMAMUX_C13CR_NBREQ_MASK		0x1f
/** @defgroup dmamux_c13cr_nbreq NBREQ Number of DMA requests to forward Defines the number of DMA requests forwarded before output event is generated. In synchronous mode, it also defines the number of DMA requests to forward after a synchronization event, then stop forwarding. The actual number of DMA requests forwarded is NBREQ+1. Note: This field can only be written when both SE and EGE bits are reset.
@{*/
/**@}*/


