grevaillot/svd_tools/headers/STM32G474xx/dmamux.h
#define DMAMUX_RG2CR_GPOL_SHIFT		17
#define DMAMUX_RG2CR_GPOL_MASK		0x03
/** @defgroup dmamux_rg2cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX_RG2CR_GE DMA request generator channel enable/disable **/
#define DMAMUX_RG2CR_GE		(1 << 16)
/** DMAMUX_RG2CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX_RG2CR_OIE		(1 << 8)

#define DMAMUX_RG2CR_SIG_ID_SHIFT		0
#define DMAMUX_RG2CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux_rg2cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_rg3cr RG3CR DMAMux - DMA request generator channel x control register
@{*/


#define DMAMUX_RG3CR_GNBREQ_SHIFT		19
#define DMAMUX_RG3CR_GNBREQ_MASK		0x1f
/** @defgroup dmamux_rg3cr_gnbreq GNBREQ Number of DMA requests to generate Defines the number of DMA requests generated after a trigger event, then stop generating. The actual number of generated DMA requests is GNBREQ+1. Note: This field can only be written when GE bit is reset.
@{*/
/**@}*/


#define DMAMUX_RG3CR_GPOL_SHIFT		17
#define DMAMUX_RG3CR_GPOL_MASK		0x03
/** @defgroup dmamux_rg3cr_gpol GPOL DMA request generator trigger event type selection Defines the trigger event on the selected DMA request trigger input
@{*/
/**@}*/

/** DMAMUX_RG3CR_GE DMA request generator channel enable/disable **/
#define DMAMUX_RG3CR_GE		(1 << 16)
/** DMAMUX_RG3CR_OIE Interrupt enable at trigger event overrun **/
#define DMAMUX_RG3CR_OIE		(1 << 8)

#define DMAMUX_RG3CR_SIG_ID_SHIFT		0
#define DMAMUX_RG3CR_SIG_ID_MASK		0x1f
/** @defgroup dmamux_rg3cr_sig_id SIGID DMA request trigger input selected
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_rgsr RGSR DMAMux - DMA request generator status register
@{*/


#define DMAMUX_RGSR_OF_SHIFT		0
#define DMAMUX_RGSR_OF_MASK		0x0f
/** @defgroup dmamux_rgsr_of OF Trigger event overrun flag The flag is set when a trigger event occurs on DMA request generator channel x, while the DMA request generator counter value is lower than GNBREQ. The flag is cleared by writing 1 to the corresponding COFx bit in DMAMUX_RGCFR register.
@{*/
/**@}*/


/**@}*/

/** @defgroup dmamux_rgcfr RGCFR DMAMux - DMA request generator clear flag register
@{*/


#define DMAMUX_RGCFR_COF_SHIFT		0
#define DMAMUX_RGCFR_COF_MASK		0x0f
/** @defgroup dmamux_rgcfr_cof COF Clear trigger event overrun flag Upon setting, this bit clears the corresponding overrun flag OFx in the DMAMUX_RGCSR register.
@{*/
/**@}*/


/**@}*/
